#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # juju_application.admin_ui will be created
  + resource "juju_application" "admin_ui" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "admin-ui"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "identity-platform-admin-ui"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.hydra will be created
  + resource "juju_application" "hydra" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "hydra"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "hydra"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.kratos will be created
  + resource "juju_application" "kratos" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "kratos"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "kratos"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.login_ui will be created
  + resource "juju_application" "login_ui" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "login-ui"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "identity-platform-login-ui-operator"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_application.openfga will be created
  + resource "juju_application" "openfga" {
      + config      = {}
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "openfga"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "2.0/stable"
          + name     = "openfga-k8s"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # juju_integration.admin_ui_public_ingress will be created
  + resource "juju_integration" "admin_ui_public_ingress" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "ingress"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = (known after apply)
          + name     = "external-ingress"
        }
    }

  # juju_integration.hydra_admin_ui_info will be created
  + resource "juju_integration" "hydra_admin_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "hydra-info"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "hydra-info"
          + name     = "hydra"
        }
    }

  # juju_integration.hydra_admin_ui_oauth will be created
  + resource "juju_integration" "hydra_admin_ui_oauth" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "oauth"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "oauth"
          + name     = "hydra"
        }
    }

  # juju_integration.hydra_database will be created
  + resource "juju_integration" "hydra_database" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "database"
          + name     = "postgresql"
        }
      + application {
          + endpoint = "pg-database"
          + name     = "hydra"
        }
    }

  # juju_integration.hydra_login_ui_ui_info will be created
  + resource "juju_integration" "hydra_login_ui_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "login-ui"
        }
    }

  # juju_integration.hydra_public_ingress will be created
  + resource "juju_integration" "hydra_public_ingress" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "public-ingress"
          + name     = "hydra"
        }
      + application {
          + endpoint = (known after apply)
          + name     = "external-ingress"
        }
    }

  # juju_integration.kratos_admin_ui_info will be created
  + resource "juju_integration" "kratos_admin_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "kratos-info"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "kratos-info"
          + name     = "kratos"
        }
    }

  # juju_integration.kratos_database will be created
  + resource "juju_integration" "kratos_database" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "database"
          + name     = "postgresql"
        }
      + application {
          + endpoint = "pg-database"
          + name     = "kratos"
        }
    }

  # juju_integration.kratos_external_idp will be created
  + resource "juju_integration" "kratos_external_idp" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "kratos-external-idp"
          + name     = "kratos"
        }
      + application {
          + endpoint = "kratos-external-idp"
          + name     = "kratos-external-idp-integrator"
        }
    }

  # juju_integration.kratos_hydra_info will be created
  + resource "juju_integration" "kratos_hydra_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "kratos"
        }
    }

  # juju_integration.kratos_login_ui_info will be created
  + resource "juju_integration" "kratos_login_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "kratos-info"
          + name     = "kratos"
        }
      + application {
          + endpoint = "kratos-info"
          + name     = "login-ui"
        }
    }

  # juju_integration.kratos_login_ui_ui_info will be created
  + resource "juju_integration" "kratos_login_ui_ui_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "kratos"
        }
      + application {
          + endpoint = "ui-endpoint-info"
          + name     = "login-ui"
        }
    }

  # juju_integration.kratos_public_ingress will be created
  + resource "juju_integration" "kratos_public_ingress" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "public-ingress"
          + name     = "kratos"
        }
      + application {
          + endpoint = (known after apply)
          + name     = "external-ingress"
        }
    }

  # juju_integration.login_ui_hydra_info will be created
  + resource "juju_integration" "login_ui_hydra_info" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "hydra"
        }
      + application {
          + endpoint = "hydra-endpoint-info"
          + name     = "login-ui"
        }
    }

  # juju_integration.login_ui_public_ingress will be created
  + resource "juju_integration" "login_ui_public_ingress" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "ingress"
          + name     = "login-ui"
        }
      + application {
          + endpoint = (known after apply)
          + name     = "external-ingress"
        }
    }

  # juju_integration.openfga_admin_ui will be created
  + resource "juju_integration" "openfga_admin_ui" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "openfga"
          + name     = "admin-ui"
        }
      + application {
          + endpoint = "openfga"
          + name     = "openfga"
        }
    }

  # juju_integration.openfga_database will be created
  + resource "juju_integration" "openfga_database" {
      + id    = (known after apply)
      + model = "identity-platform"

      + application {
          + endpoint = "database"
          + name     = "openfga"
        }
      + application {
          + endpoint = "database"
          + name     = "postgresql"
        }
    }

  # juju_offer.kratos_info_offer will be created
  + resource "juju_offer" "kratos_info_offer" {
      + application_name = "kratos"
      + endpoint         = "kratos-info"
      + id               = (known after apply)
      + model            = "identity-platform"
      + name             = "kratos-info-offer"
      + url              = (known after apply)
    }

  # juju_offer.oauth_offer will be created
  + resource "juju_offer" "oauth_offer" {
      + application_name = "hydra"
      + endpoint         = "oauth"
      + id               = (known after apply)
      + model            = "identity-platform"
      + name             = "oauth-offer"
      + url              = (known after apply)
    }

  # module.kratos_external_idp_integrator.juju_application.external_idp_integrator will be created
  + resource "juju_application" "external_idp_integrator" {
      + config      = (sensitive value)
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "kratos-external-idp-integrator"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "latest/edge"
          + name     = "kratos-external-idp-integrator"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

  # module.postgresql.juju_application.postgresql will be created
  + resource "juju_application" "postgresql" {
      + config      = {
          + "plugin_btree_gin_enable" = "true"
          + "plugin_pg_trgm_enable"   = "true"
          + "plugin_uuid_ossp_enable" = "true"
        }
      + constraints = (known after apply)
      + id          = (known after apply)
      + model       = "identity-platform"
      + name        = "postgresql"
      + placement   = (known after apply)
      + principal   = (known after apply)
      + storage     = (known after apply)
      + trust       = true
      + units       = 1

      + charm {
          + base     = "ubuntu@22.04"
          + channel  = "14/stable"
          + name     = "postgresql-k8s"
          + revision = (known after apply)
          + series   = (known after apply)
        }
    }

Plan: 26 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kratos_info_offer_url = (known after apply)
  + oauth_offer_url       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @shipperizer, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*